Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.InvalidExtrusionCurveloopError
Base sketch for extrusion is invalid.

Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.InvalidExtrusionCurveloop
Base sketch for extrusion is invalid.

Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.ExtrusionTooThin
Extrusion is too thin.

Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.CannotDrawExtrusionsError
Can't make Extrusion.

Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures.CannotDrawExtrusions
Can't make Extrusion.

Autodesk.Revit.DB.BuiltInFailures.ExtrusionFailures
Failures about Extrusions.